InformationRegisters/ВыбранныеВопросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВыбранныеВопросы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вопросы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыТест</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Глава</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Главы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыбранныеВопросы/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВопросыПриИзменении(Элемент)
	 ЭтаФорма.Счетчик = 6;
КонецПроцедуры

&НаКлиенте
Процедура МножественныйВыборВопросов(Команда)
	ПараметрыФормы = Новый Структура("РежимВыбора,МножественныйВыбор",Истина,Истина);
	
	ОткрытьФорму("Справочник.ВопросыТест.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Для Каждого  Выбранныйэлемент из ВыбранноеЗначение Цикл
		  //Запись = РегистрыСведений.ВыбранныеВопросы.СоздатьМенеджерЗаписи();
		  //Запись.Период = ТекущаяДата();
		  //Запись.Вопросы
	КонецЦикла;	
КонецПроцедуры
&НаСервере
Функция ОпределитьКоличествоВыбранныхВопросов()
	КоличествоВопросов = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА ВыбранныеВопросы.Счетчик = 0
		|				ТОГДА ВыбранныеВопросы.Вопросы
		|		КОНЕЦ) КАК ОтработанныеВопросы,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА ВыбранныеВопросы.Счетчик > 0
		|				ТОГДА ВыбранныеВопросы.Вопросы
		|		КОНЕЦ) КАК ВопросыВРаботе
		|ИЗ
		|	РегистрСведений.ВыбранныеВопросы КАК ВыбранныеВопросы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 КоличествоВопросов.Вставить("ОтработанныеВопросы", Выборка.ОтработанныеВопросы);
		 КоличествоВопросов.Вставить("ВопросыВРаботе", Выборка.ВопросыВРаботе);
	КонецЦикла;
	
	Возврат  КоличествоВопросов

КонецФункции // ОпределитьКоличествоВыбранныхВопросов()

&НаКлиенте
Процедура РасчетКоличества()
	КоличествоВопросов = ОпределитьКоличествоВыбранныхВопросов();
	 
	 Для Каждого Элемент из КоличествоВопросов Цикл
	     Если Элемент.Ключ  = "ОтработанныеВопросы" Тогда
	    	 ОтработанныеВопросы =  Элемент.Значение;
	     КонецЕсли;
	     Если Элемент.Ключ  = "ВопросыВРаботе" Тогда
	    	 ВопросыВРаботе =  Элемент.Значение;
	     КонецЕсли;
	 КонецЦикла;
	 ВсегоВопросов = ОтработанныеВопросы + ВопросыВРаботе;

КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 РасчетКоличества();	 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	РасчетКоличества();
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьСчетчикКнопка(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ФормаУвеличитьСчетчик"); 
		
КонецПроцедуры     
//Изменить
&НаСервере
Процедура УвеличитьСчетчик(Глава,Счетчик)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыбранныеВопросы.Счетчик 				КАК Счетчик,
		|	ВыбранныеВопросы.Вопросы 				КАК Вопросы,
		|	ВыбранныеВопросы.Период 				КАК Период
		|ИЗ
		|	РегистрСведений.ВыбранныеВопросы КАК ВыбранныеВопросы
		|ГДЕ
		|	ВыбранныеВопросы.Глава = &Глава
		|	И ВыбранныеВопросы.Счетчик = 0";
	
	Запрос.УстановитьПараметр("Глава", Глава);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл   
		НайденныйВопрос = Выборка.Вопросы;
		 ТекЗапись = РегистрыСведений.ВыбранныеВопросы.СоздатьМенеджерЗаписи();
		 ТекЗапись.Вопросы = НайденныйВопрос;
		 ТекЗапись.Прочитать(); 
		 
		 ТекЗапись.Период = Выборка.Период; 
		 ТекЗапись.Вопросы = НайденныйВопрос; 
		 ТекЗапись.Глава = Глава;
		 ТекЗапись.Счетчик = Счетчик;
		 ТекЗапись.Записать();
	КонецЦикла;
	
		
	//аналог F5
	ЭтаФорма.Элементы.Список.Обновить();  
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	   УвеличитьСчетчик(Параметр.Глава,Параметр.Счетчик);    
	   РасчетКоличества();
КонецПроцедуры
&НаСервере
Процедура  ЗаписьВыбранныеВопросы(МассивСсылок)
	Набор = РегистрыСведений.ВыбранныеВопросы.СоздатьНаборЗаписей();
	Период = ТекущаяДата();
	Для Каждого Значение из МассивСсылок Цикл       
	   
	   
	   Набор.Отбор.Глава.Установить(Значение.Глава);	
	   Запись 			= Набор.Добавить();
	   Запись.Период 	= Период;
	   Запись.Вопросы 	= Значение;   
	   Запись.Глава 	= Значение.Глава;
	   Запись.Счетчик	= Константы.Счетчик.Получить();  
	   Период = Период +1;
	КонецЦикла;
	Набор.Записать(Ложь);  // не удаляем другие записи из регистра 
	
КонецПроцедуры


&НаКлиенте
  Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
  	МассивСсылок =  ВыбранноеЗначение; //Вернётся массив с выбранными значениями (Даже если значение только одно )  
	ЗаписьВыбранныеВопросы(МассивСсылок); 
	РасчетКоличества();   
	//аналог F5
	ЭтаФорма.Элементы.Список.Обновить();
КонецПроцедуры
